Classes | Enumerations | Functions
Keynote
Functions related to keynotes, and the keynoting workflow. More...
 Classes
class  | ACAPI::Keynote::v1::KeynoteFolder
A class that represents a folder in the keynote tree structure. More...
class  | ACAPI::Keynote::v1::KeynoteItem
A class that represents an item in the keynote tree structure. More...
class  | ACAPI::Keynote::v1::KeynoteManager
A class that contains keynote related functions. More...
 Enumerations
enum class  | ACAPI::Keynote::v1::KeynoteManager::AutoTextTokenSelector { Key , Title , Description , Reference }
Part of the keynote, an autotext should refer to.
 Functions
Result< KeynoteManager >  | ACAPI::Keynote::v1::CreateKeynoteManager ()
A function to create keynote manager instance, that lets you query and manipulate keynote related data.
Detailed Description
Functions related to keynotes, and the keynoting workflow.
Function Documentation
◆ CreateKeynoteManager()
 Result< KeynoteManager > ACAPI::Keynote::v1::CreateKeynoteManager  |  ( |   | )
inline
A function to create keynote manager instance, that lets you query and manipulate keynote related data.
Returns
The keynote manager instance.